<<<<<<< HEAD
select * from Book
delete from book

select * from 普通用户表
delete from 普通用户表

use Bookstore 
CREATE TABLE [Book](
	[bookId] [char](20) primary key,
	[bookName] [char](50) NOT NULL,
	[bookGenres] [char](20) NOT NULL,
	[bookAuthor] [char](20) NOT NULL,
	[bookPrice] [tinyint] NOT NULL,
	[bookPress] [char](50) NOT NULL
)
insert into Book(bookId,bookName ,bookGenres ,bookAuthor ,bookPrice,bookPress) values
	('Z001','道德经','中国哲学','老子',100,'甘肃人民出版社'),
	('Z002','孟子','中国哲学','孟子',100,'甘肃人民出版社'),
	('Z003','论语','中国哲学','孔子',80,'甘肃人民出版社'),
	('Z004','尼古拉的遗嘱','宗教理论','PINGZ',50,'甘肃人民出版社'),
	('Z005','万物简史','宗教理论','比尔·布莱森',20,'甘肃人民出版社'),
	('Z006','科学技术哲学导论','科学技术哲学','刘大椿',90,'甘肃人民出版社'),
	('Z007','科学究竟是什么','科学技术哲学','查尔默斯',55,'甘肃人民出版社'),
	('P001','沧浪之水','中国政治','阎真',62,'甘肃人民出版社'),
	('P002','孙子兵法','中国军事','孙子',65,'甘肃人民出版社'),
	('P003','中国的军事战略','中国军事','国务院新闻办公室',50,'甘肃人民出版社'),
	('S001','将进酒','诗歌','李白',50,'甘肃人民出版社'),
	('S002','春江花月夜','诗歌','张若虚',66,'甘肃人民出版社'),
	('S003','长恨歌','诗歌','白居易',47,'甘肃人民出版社'),
	('S004','琵琶行','诗歌','白居易',69,'甘肃人民出版社'),
	('S005','离骚','诗歌','屈原',56,'甘肃人民出版社'),
	('S006','荷塘月色','散文','朱自清',55,'甘肃人民出版社'),
	('S007','生命','散文','沈存文',99.9,'甘肃人民出版社'),
	('S008','把时间花在心灵上','散文','林清玄',55.6,'甘肃人民出版社'),
	('S009','伟大与渺小','散文','臧克家',86.5,'甘肃人民出版社'),
	('S010','人生像一首诗','散文','林语堂',69.3,'甘肃人民出版社'),
	('X011','秋天的怀念','散文','史铁生',89,'甘肃人民出版社'),
	('X012','西游记','小说','吴承恩',99.9,'甘肃人民出版社'),
	('X013','求魔','小说','耳根',69.3,'甘肃人民出版社'),
	('X014','剑道独尊','小说','剑游太虚',89,'甘肃人民出版社'),
	('C001','人生像一首诗','成功','林语堂',69.3,'甘肃人民出版社'),
	('C002','关系','人际沟通','史铁生',89,'甘肃人民出版社'),
	('F003','中国法学理念','法学理论','yujiang',99.9,'甘肃人民出版社'),
	('Y003','新世纪大学','语言文字','小丑',69.3,'甘肃人民出版社'),
	('Y004','java语言设计','语言文字','张月平',89,'甘肃人民出版社'),
	('Y005','社会科学','社会科学总论','支行',69.3,'甘肃人民出版社'),
	('Y006','社会讲义','社会科学总论','墨子',89,'甘肃人民出版社'),
	('Y007','新世纪大学','语言文字','小丑',69.3,'甘肃人民出版社'),
	('Y008','java语言设计','语言文字','张月平',89,'甘肃人民出版社'),
	('W001','鲁冰徐漂流记','中国现代小说','鲁冰逊',86,'甘肃人民出版社'),
	('W002','海底两万里','中国现代小说','亚辉',100,'甘肃人民出版社'),
	('W003','八十天环游世界','中国现代小说','袁亚',80,'甘肃人民出版社'),
	('W004','飞狐外传','武侠小说','金庸',50,'甘肃人民出版社'),
	('W005','连城诀','武侠小说','金庸',20,'甘肃人民出版社'),
	('W006','天龙八部','武侠小说','金庸',90,'甘肃人民出版社')
=======

use Bookstore 
create table Book(
	bookName char(50) not null ,
	bookGenres char(20) not null,
	bookAuthor char(20) not null,
	bookPrice tinyint 
);

insert into Book(bookName ,bookGenres ,bookAuthor ,bookPrice ) values
	('道德经','中国哲学','老子',100),
	('孟子','中国哲学','孟子',100),
	('论语','中国哲学','孔子',80),
	('尼古拉的遗嘱','宗教理论','PINGZ',50),
	('万物简史','宗教理论','比尔·布莱森',20),
	('科学技术哲学导论','科学技术哲学','刘大椿',90),
	('科学究竟是什么','科学技术哲学','查尔默斯',55),
	('沧浪之水','中国政治','阎真',62),
	('孙子兵法','中国军事','孙子',65),
	('中国的军事战略','中国军事','国务院新闻办公室',50)
>>>>>>> 41ebf7d88b3ef9cd38b46e1b73ce164c29239ad1

select * from Book